Revit 2020 API
Units.IsModifiableUnitType Method
 Checks whether the default FormatOptions can be modified for a given unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2014
Syntax
C#
public static bool IsModifiableUnitType(
	UnitType unitType
)
Visual Basic
Public Shared Function IsModifiableUnitType ( _
	unitType As UnitType _
) As Boolean
Visual C++
public:
static bool IsModifiableUnitType(
	UnitType unitType
)
Parameters
unitType
Type: Autodesk.Revit.DB.UnitType
 The unit type to check.
Return Value
 True if the FormatOptions can be modified, false otherwise.
Remarks
 The Units class stores a FormatOptions object for every valid unit type, but not all of them can be directly modified. Some, like UT_Number and UT_SiteAngle, have fixed definitions. Others have definitions which are automatically derived from other unit types. For example, UT_SheetLength is derived from UT_Length and UT_ForceScale is derived from UT_Force.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Units Class
Autodesk.Revit.DB Namespace